#include<stdio.h>
int main (){
	int a,b,c,d,e,f;
	a=2;b=3;c=4;d=5;e=6;f=7;
	printf("%d,%d,%d,%d,%d,%d\n",a,b,c,d,e,f);	
    //1.输出值：2，3，4，5，6，7； 
	printf("%d,%d,%d,%d,%d,%d\n",a,b,c++,d,--e,-f);	
    //2.输出值：2，3，4（c++此时保持旧值4），5，5（--e此时打印后值），-7； 	
	a=b+=c++-d+--e/-f; 	
    //3. a将被重新赋值，按优先级计算； 
    //4.此时e=5 --e=4 最后e=4；
    //5.--e/-f=4/-7=0（整数截断）；
    //6.此时c=5，c++=5 最后c=6（不计入此时计算当中）；
    //c++-d=5-5=0;
    //7. 完整c++-d+--e/-f=5-5+4/-7=0;
    //8. 即a=b+=0 b=3+0=3;
    //9. 所以a=3 
    printf("%d,%d,%d,%d,%d,%d\n",a,b,c,d,e,f);
    //10. 输出值：3，3，6，5，4，7； 	
	return 0;
} 
